Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2
The Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2 class is the abstract base class for any feature enabling
the modification of Tekla.Structures.Model.ModelObject instances using the Tekla.BIM.DirectManipulation.Services.Manipulators.Manipulator pattern.
The type of Tekla.Structures.Model.ModelObject modified by the feature.
The type of Tekla.BIM.DirectManipulation.Services.Manipulators.Manipulator used for modifying instances of type Tekla.Structures.Model.ModelObject.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2.Manipulators
Gets the map of Tekla.Structures.Model.ModelObject instances and their manipulators.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2.CreateManipulatorFor(`0)
Creates a new  instance enabling manipulation of the given .
modelObject: The  instance to get a new  for.
Returns: A new  instance enabling manipulation of the given .

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2.GetActivationDefinitions
Gets the activation definitions for the current feature,
which by default is a Tekla.BIM.DirectManipulation.Services.State.CommandType.Modify command for objects of type .
Returns: The activation definitions to activate the feature on.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2.OnActivated(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)
Initializes the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2 instance managing the object/manipulator relations.
eventArgs: The event arguments providing all data for feature activation.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2.OnRefreshSuggested(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)
Updates the Tekla.Structures.DirectManipulation.Model.ModelObjectManipulatorMap`2 instance managing the object/manipulator relations.
eventArgs: The event arguments providing all data for feature refreshing.

Tekla.Structures.DirectManipulation.Model.ModelObjectManipulationFeature`2.IsCompatible(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)
Determines whether the current command is compatible with the new activation event arguments.
If yes, the command could continue even if the activation definition is not met.
eventArgs: The new activation event arguments.
Returns: True if the current command is compatible with the new activation event arguments; otherwise, false.